# Задача 89. Машина произвежда топки за тенис. Известно е, че диаметърът на топка, произведена от машината, 
#   е случайна величина със стандартно отклонение sigma=0.12 см. Измерен е диаметърът на 45 случайно избрани топки, произведени от машината.
# а) Ако средният диаметър на избраните топки е 6.73 см, намерете 95-процентен доверителен интервал за средния диаметър на топките, произведени от машината.
# б) Ако средният диаметър на избраните топки е 6.76 см, намерете 95-процентен доверителен интервал за средния диаметър на топките, произведени от машината.

# Търсим среден диаметър, при положение, че знаем дисперсия -> z-тест за средно трябва да приложим
n <- 45
sigma <- 0.12
confidence_interval_perc <- 0.95
alpha <- 1 - confidence_interval_perc

z_test_conf_interval <- function(n, sigma, x_observed, alpha) {
  # Важно - alpha/2 е процент от интервала, а не стойност за z-obs -> прекарваме я през квантилната функция
  b1 <- x_observed - qnorm(1 - alpha/2) * (sigma / sqrt(n))
  b2 <- x_observed + qnorm(1 - alpha/2) * (sigma / sqrt(n))
  # qnorm(1 - alpha/2), а не qnorm(alpha/2), понеже се питаме за участъка след alpha/2 колко е, а не преди него
  c(b1, b2)
}

# z_obs = (x_obs - mu_zero) / (sd / sqrt(n))
# За да остане z_obs, т.е да не отхвърлим H0, то z(-alpha/2) <= z_obs <= z(alpha/2)
# Изразяваме mu_zero от z_obs -> забележи, че z(alpha/2) е конкретна стойност за z_obs !!!
# z_obs * (sd / sqrt(n)) - x_obs =  - mu_zero =>  -z_obs * (sd / sqrt(n)) + x_obs = mu_zero
# Заменяме в горния израз
# z(-alpha/2) * (sd / sqrt(n)) + x_obs <= mu_zero <= z(alpha/2)  * (sd / sqrt(n)) + x_obs
# x_obs - z(alpha/2) * (sd / sqrt(n)) <= mu_zero <= x_obs + z(alpha/2)  * (sd / sqrt(n))
# Получихме неравенството за интервалите на доверие

# a)
x_observed <- 6.73
z_test_conf_interval(n, sigma, x_observed, alpha) # 6.694939 6.765061

# b)
x_observed <- 6.76
z_test_conf_interval(n, sigma, x_observed, alpha) # 6.724939 6.795061





# Задача 90. Кадмият е тежък метал, който може да се натрупа до високи нива в гъбите. Измерена е концентрацията на кадмий в случайна извадка от 10 
#   горски гъби събрани вдадена местност. Резултатите са следните (в мг/кг):
#       3.1 3.0 3.7 2.6 4.2 3.8 3.6 2.7 3.8 4.4
#   Може да предположим, че концентрацията на кадмий е нормално разпределена.
#   а) Намерете 95-процентен доверителен интервал за средната концентрация на кадмийв горските гъбите в дадената местност.
#   б) Намерете 90-процентен доверителен интервал за средната концентрация на кадмийв горските гъбите в дадената местност.

# Дисперсията е неизвестна, търсим средно -> прилагаме t.test за средно - въпреки малкия брой данни, те са нормално разпределени, т.е клонят към т-разпределение съвместно
x <- c(3.1, 3.0, 3.7, 2.6, 4.2, 3.8, 3.6, 2.7, 3.8, 4.4)
t.test(x, alternative="two.sided", conf.level = 0.95)$conf.int[1:2] # 3.051028 3.928972
t.test(x, alternative="two.sided", conf.level = 0.90)$conf.int[1:2] # 3.134284 3.845716

# !! 2 важни извода - t.test можем да пуснем и без да подаваме очаквано средно - нали това е смисълът на интервалите на доверие
# Друго нещо е да видим, че при намаляне на процента на доверие (тоест увеличаване на алфа), то интервалът се свива





# Задача 91. Проведен е експеримент с монета. При n хвърляния на монетата се паднало ези x пъти. 
# Намерете 95-процентен доверителен интервал за вероятността да се падне ези при хвърляне на тази монета, ако:
alpha <- 1 - 0.95
# а) n=100 x=58
prop.test(x=58, n=100, alternative="two.sided", correct=FALSE, conf.level = alpha)$conf.int[1:2]  # 0.4820649 0.6720162
# б) n=200 x=116
prop.test(x=58, n=100, alternative="two.sided", correct=FALSE, conf.level = alpha)$conf.int[1:2]
# в) n=100 x=61
prop.test(x=58, n=100, alternative="two.sided", correct=FALSE, conf.level = alpha)$conf.int[1:2]

# При доверителните интервали нямаме предположение за средно/пропорция - искаме да намерим такива 2 стойности за средно и пропорция, така че в 95% (за алфа = 0.05)
#   mu / prop да попадат като стойности в този интервал. Забележи също, че и prop.test и t.test приемат параметър conf.level -> желателно е да използваме именовани аргументи,
#   а не позиционни, за да можем явно и лесно да извикваме функциите си с правилните параметри





# Задача 92. Измерена е дължината на дясното ухо на 66 случайно избрани жени на възраст между 18 и 30 години. Резултатите показват средна дължина mu=61.9 мм и 
#   стандартно отклонение 4 мм. Нека предположим, че популационната дисперсия е известна и sigma^2 = (4.1)^2.
# а) Намерете 95-процентен доверителен интервал за средната дължина на дясното ухо на жените на възраст между 18 и 30 години.
n <- 66
mu_observed <- 61.9
sigma <- 4
alpha <- 1 - 0.95

# Известна ни е дисперсията, търсим средно => z-тест за средно (n > 30). Искаме да приложим интервал на доверие за него - изразяваме си отново z_obs
# z(-alpha/2) <= z_obs <= z(alpha/2)  , z_obs = (x_obs - mu_zero) / (sigma / sqrt(n)) , заменяме с z_obs долу
# z(-alpha/2) <= (x_obs - mu_zero) / (sigma / sqrt(n)) <= z(alpha/2), искаме да оставим само mu_zero ( |* (sigma / sqrt(n)) на двете страни)
# z(-alpha/2) * (sigma / sqrt(n)) <= x_obs - mu_zero <= z(alpha/2) * (sigma / sqrt(n)), прехвърляме x_obs от другата страна
# z(-alpha/2) * (sigma / sqrt(n)) - x_obs <=  -mu_zero <= z(alpha/2) * (sigma / sqrt(n)) - x_obs | *(-1)
# x_obs - z(-alpha/2) * (sigma / sqrt(n))  >=  mu_zero >= x_obs - z(alpha/2) * (sigma / sqrt(n)) 

# limit <- x_obs -+ quantil(1 - z(alpha/2)) * sd / sqrt(n)

z_test_conf_interval <- function(n, mu_observed, sigma, alpha) {
  diff <- qnorm(1 - alpha / 2) * (sigma / sqrt(n))
  left_side <- mu_observed - diff
  right_side <- mu_observed + diff
  c(left_side, right_side)
}

z_test_conf_interval(n, mu_observed, sigma, alpha) # 60.93498 62.86502

# б) Ако са направени измервания на 88 жени и са получени същите резултати за средната дължина и стандартното отклонение, намерете 95-процентен доверителен интервал
#      за средната дължина на дясното ухо на жените на възраст между 18 и 30 години.
n <- 88
z_test_conf_interval(n, mu_observed, sigma, alpha) # 61.06427 62.73573





# Задача 93. Проведен е експеримент, при който 58 домашни гълъба са пуснати на свобода от непознато място, което е на разстояние 106 км от дома им. От тях 32 намерили пътя към дома си. 
#   Намерете 95-процентен доверителен интервал за вероятността гълъб от дадения вид да намери пътя към дома си от непознато място на 106 км.

# Търсим вероятност при положение бернулиеви опити -> прилагаме prop.test
prop.test(x=32, n=58, alternative = "two.sided", correct=FALSE, conf.level = 0.95)$conf.int[1:2]  # 0.4245208 0.6725015





# Задача 94. Генерирайте данни x1, x2, ..., xn от равномерно разпределение в интервала (5, 9). Намерете 95-процентен доверителен интервал за средното. 
# Повторете 10000 пъти за n={20, 50, 100, 500}. В каква част от случаите доверителният интервал съдържа 7?

# Не знаем дисперсия, търсим средно => т.тест (въпреки, че първата стойност не е ОК (n=20 < 30), заради ЦГТ)

# Изпълнява 1 експреримент от случайно генерираните числа, интервалът им на 95% доверие да съдържа числото value (7)
sim_value_in_conf_interval <- function(n, value, alpha) {
  x <- runif(n, 5, 9)
  conf_interval_limits <- t.test(x, alternative = "two.sided", conf.level=1 - alpha)$conf.int[1:2]
  conf_interval_limits[1] <= value & conf_interval_limits[2] >= value 
}

# Цикли през всички стойност за n, като за всяка изчислява вероятността на симулацията да се съдържа числото 7 в доверителния интервал
prob_value_in_conf_interval <- function(trials, value, alpha) {
  n_values <- c(20, 50, 100, 500)
  result_vector <- c()
  for (n in n_values) {
    result <- replicate(trials, sim_value_in_conf_interval(n, value, alpha))
    prob <- sum(result) / trials
    result_vector <- c(result_vector, prob)
  }
  result_vector
}

prob_value_in_conf_interval(trials = 10000, value = 7, alpha = 0.05)  # 0.9491 0.9514 0.9474 0.9504





# Задача 95. Генерирайте данни x1, x2, .... , xn от равномерно разпределение в интервала (5, 9). Проверете хипотезата mu = 7 срещу mu != 7.
#   Повторете 10000 пъти за n={20, 50, 100, 500}. В каква част от случаите нулевата хипотеза не се отхвърля?

# Това даже не е към темата за доверителни интервали, а по-скоро за t.test
sim_t_test <- function(n, mu_zero, alpha) {
  x <- runif(n, 5, 9)  # Отново е т.тест, понеже пак генерираме числа
  p_value <- t.test(x, mu = mu_zero, alternative = "two.sided")$p.value
  # Питаме се кога не се отхвърля, т.е тогава за нас е успех (Еми отхвърля се само когато p_value <= alpha => p_value > alpha не се)
  p_value > alpha
}

prob_t_test <- function(trials, value, alpha) {
  n_values <- c(20, 50, 100, 500)
  result_vector <- c()
  for (n in n_values) {
    result <- replicate(trials, sim_t_test(n, value, alpha))
    prob <- sum(result) / trials
    result_vector <- c(result_vector, prob)
  }
  result_vector
}

prob_t_test(trials = 10000, value = 7, alpha = 0.05)  # 0.9480 0.9519 0.9513 0.9495





# Комбинация от 94 и 95 задача
# Задача 96. Генерирайте данни x1, x2, .... , xn от равномерно разпределение в интервала (5, 9). Намерете 95-процентен доверителен интервал за средното. 
#  Проверете хипотезата mu = 7 срещу mu != 7. Повторете 10000 пъти за n={20, 50, 100, 500}. В каква част от случаите доверителният интервал съдържа 7 и 
#  едновременно с това нулевата хипотеза не се отхвърля?

sim_conf_interval_contains_value_and_t_test_hypothesis_0_stands <- function(n, mu_zero, alpha) {
  x <- runif(n, 5, 9)  # Отново е т.тест, понеже пак генерираме числа
  
  # ВАЖНО - винаги тестовете трябва да са едни и същи, а не да тестваме отделно за двете!
  # Друго важно нещо - макар p_value да не изисква conf.level, то се иска от доверителния интервал - подаваме го на общия t.test
  t_test_result <- t.test(x, mu = mu_zero, alternative = "two.sided", conf.level=1 - alpha)
  
  p_value <- t_test_result$p.value
  hypothesis_0_stands <- p_value > alpha
  # Питаме се кога не се отхвърля, т.е тогава за нас е успех (Еми отхвърля се само когато p_value <= alpha => p_value > alpha не се)
  
  conf_interval_limits <- t_test_result$conf.int[1:2]
  conf_interval_contains_value <- conf_interval_limits[1] <= value & conf_interval_limits[2] >= value 
  
  hypothesis_0_stands & conf_interval_contains_value
}

prob_conf_interval_contains_value_and_t_test_hypothesis_0_stands <- function(trials, value, alpha) {
  n_values <- c(20, 50, 100, 500)
  result_vector <- c()
  for (n in n_values) {
    result <- replicate(trials, sim_conf_interval_contains_value_and_t_test_hypothesis_0_stands(n, value, alpha))
    prob <- sum(result) / trials
    result_vector <- c(result_vector, prob)
  }
  result_vector
}

prob_t_test(trials = 10000, value = 7, alpha = 0.05)  # 0.9490 0.9475 0.9487 0.9545





# Задача 97. Като са използвани данните от 50 измервания на дадена величина е намерен 95-процентен доверителен интервал 
# [25.0128, 26.0212] за средното mu. Искаме да проверим хипотезата H0 : mu = 25 срещу двустранна алтернатива при 
# ниво на значимост alpha = 0.05. Какъв извод ще направим (отхвърляме ли нулевата хипотеза)?
mu_zero <- 25
n <- 50
alpha <- 0.05
# t.test за средно, само че трябва да си го конструираме от t_obs формулата -> не, не вижте сега

# Ние не можем да си го конструираме, понеже имаме хипотетичното средно, а не наблюдаваното такова - обаче не ни и трябва да сглобяваме модел

# По условие интервалът на доверие (в който H0 се запазва) е между [25.0128, 26.0212], а mu_zero (хипотетичното ни средно) е извън него.
# Можем лесно да се откажем от хипотезата H0, тъй като mu не принадлежи на доверителния интервал - имаме основание да твърдим, че средното е различно от 25
# Въпрос на интерпретация е какво се случва точно в точките а = 25.0128 и б = 26.0212, т.е ако mu_zero е там, дали отхвърляме H0.
# По конвенция на СЕМ практикумите, тези стойности се считат за малко вероятни (получават се при алфа / 2, алфа = 0.05), т.е трябва да отхвърлим H0
# !!! Обаче винаги - ако сме стриктно в интервала - не отхвърляме H0, а ако сме  стриктно извън него, то отхвърляме H0 в полза на H1
