# Задача 98. Резултатите от 180 хвърляния на зар са дадени в таблицата:
#  Изход:                 1  2  3  4  5  6
#  Брой пъти (от 180)    28 36 36 30 27 23
#   Може ли въз основа на тези данни да се заключи, че зарът е балансиран?

# Искаме да изследваме набор от вероятности (пропорции) -> прилага Хи квадрат тест за съгласуваност
# В х вектора са ни реалните измервания, в p вектора (очакваните)

# Балансиран? Всеки изход е равновероятен

# H0: p1 = p2 = p3 = p4 = p5 = p6 = 1/6
# H1: (p1, p2, p3, p4, p5, p6) != (1/6, 1/6, 1/6, 1/6, 1/6, 1/6)
x <- c(28, 36, 36, 30, 27, 23)
probabilities <- rep(1/6, times = 6)
chisq.test(x, p=probabilities)$p.value # 0.4843557 > alpha
# Нямаме достатъчно основание да отхвърлим H0, т.е можем да твърдим, че зарът е балансиран





# Задача 99. Честотите на срещане на буквите в английския език са следните (в %):
#   E      T    A    O    I    N   S     R    H    D  other
#  12.02 9.10 8.12 7.68 7.31 6.95 6.28 6.02 5.92 4.32 26.28

# В текст, състоящ се от 2004 букви, броят срещания на съответните букви е:
#   E  T   A   O   I   N   S   R   H    D  other
# 221 153 183 111 113 152 103 197  38  104 629

# Подкрепят ли тези данни твърдението, че текстът е на английски?

# Отново сме в задача за проверяване на пропориця измежду N събития - хи-квадрат тест за съгласуваност
x <- c(221, 153, 183, 111, 113, 152, 103, 197, 38, 104, 629)
probabilities <- c(12.02, 9.10, 8.12, 7.68, 7.31, 6.95, 6.28, 6.02, 5.92, 4.32, 26.28)
probabilities <- probabilities / 100 # За да ги нормира (сумира всички събития до 1-ца, т.е образува пълна група от събития)
chisq.test(x, p=probabilities)$p.value # 2.725521e-29 < 0.05 (alpha)
# Отхвърляме H0 в полза на H1 - имаме основание да твърдим, че текстът не е написан на английски език





# Задача 100. Според законите на Мендел, даден сорт грах може да има бели, розови или червени цветове, с вероятности съответно 1/4, 1/2, 1/4. 
#   Направена е извадка от 564 растения от този сорт. От тях 141 цъфтели в бяло, 291 в розово и 132 в червено. 
#   В съгласие ли са тези резултати с теорията на Мендел?

# Отново се интересуваме от вероятността на пълна група от събития, при положение, че имаме предполагаеми вероятности и емпирични резултати
# Прилагаме хи-квадрат тест за съгласуваност
x <- c(141, 291, 132)
probabilities <- c(1/4, 1/2, 1/4)
chisq.test(x, p=probabilities)$p.value # 0.6499557 > 0.05 -> Нямаме основание да отхвърлим H0, т.е резултатите са в съгласие с теорията на Мендел





# TODO - да се направят задачите със зареждане на външни данни

#   Задача 101. В данните pi2000 са първите 2000 цифри на числото Pi. Може ли да се
# твърди, че всяка цифра се среща с една и съща вероятност?

#   Задача 102. Използвайте данните survey от пакета MASS и направете двумерна таблица
# на пушенето по пола. Проверете хипотезата за независимост между пушенето и пола.

# Задача 103. Във файла ManWomanEye.txt има данни за цвета на очите на 204 семейни
# двойки. Има ли връзка между цвета на очите на мъжа и цвета на очите на жената?

#   Задача 104. Разгледайте данните HairEyeColor. Има ли връзка между цвета на косата
# и цвета на очите?




#   Задача 105. В таблицата са представени данни за броя на пострадалите при катастрофи пътници, като са класифицирани 
#     по степен на нараняванията и по това дали пътникът е използвал предпазен колан.

#       Наранявания
#           Няма   Леки Средни Тежки
# С колан   12813   647    359    42
# Без колан 65963  4000   2642   303

# Има ли връзка между използването на предпазен колан и степента на нараняванията?

car_belt_injuries <- data.frame(
  "Няма"   = c(12813, 65963),
  "Леки"   = c(647, 4000),
  "Средни" = c(359, 2642),
  "Тежки"  = c(42, 303),
  row.names = c("С колан", "Без колан")
)
car_belt_injuries

# Питаме се, дали има връзка между 2 случайни величини - К = "ползване на колан" и СнН = "стенеп на наранявания"
# Ще приложим хи-квадрат тест за независимост
# H0: К независимо с СнН за всяко i, j
# H1: К зависимо с СнН за някое i, j

chisq.test(car_belt_injuries)$p.value # 8.610376e-13 < 0.05, имаме основание да твърдим, че K CнН не са независими, т.е
# Отхвърляме хипотеза H0 в полза на алтернативната H1





# Задача 106. Симулирайте n хвърляния на балансиран зар. Като използвате генерираните данни, проверете хипотезата, 
#  че всяка от страните се пада с една и съща вероятност. Повторете 10000 пъти за n = 100,200,400. 
#  Колко често заключението на теста е вярно?

sim_dice_prob <- function(n) {
  # Зарът е балансиран, хвърляме N пъти
  sides <- 1:6
  thrown_sides <- sample(sides, n, replace=TRUE)
  # thrown_sides са ни емпиричните резултати, трябва да ги набухаме във вектор на честотите
  frequencies <- c(sum(thrown_sides == 1),
                   sum(thrown_sides == 2),
                   sum(thrown_sides == 3),
                   sum(thrown_sides == 4),
                   sum(thrown_sides == 5),
                   sum(thrown_sides == 6)
  )
  p_value <- chisq.test(frequencies, p=rep(1/6, 6))$p.value
  alpha <- 0.05
  p_value > alpha
}

prob_dice_prob <- function(trials) {
  n_values <- c(100, 200, 400)
  prob_results <- c()
  for (n in n_values) {
    res <- replicate(trials, sim_dice_prob(n))
    single_prob <- sum(res) / trials
    prob_results <- c(prob_results, single_prob)
  }
  prob_results
}

prob_dice_prob(trials = 10000) # 0.9515 0.9509 0.9529
# са вероятностите, че хиквадрат теста ще отчете, че всяко събитие се случва с вероятност 1/6 за n съответно 100, 200, 400