# Задача 18. (Биномно/Биномиално) Хвърляме зар 10 пъти.
# а) Каква е вероятността да се паднат само 2 шестици?
dice_throws <- 10
#P(X=2)
dbinom(2, dice_throws, 1/6)
choose(dice_throws,2)*(1/6)^2*(5/6)^8

# б) Каква е вероятността да се паднат не повече от 2 шестици?
# P(X<=2) 
pbinom(2, dice_throws, 1/6)

#       в) Каква е вероятността да се паднат 2 или повече шестици?
# P(X >= 2) == 1 - P(X<= 1)
1 - pbinom(1, dice_throws, 1/6)

#       г) Каква е вероятността да се паднат между 3 и 8 шестици?
# P(3 <= X <= 8) = P(X<=8) - P(X<=2)
pbinom(8, dice_throws, 1/6) - pbinom(2, dice_throws, 1/6)
sum(dbinom(3:8, dice_throws, 1/6))


# Задача 19. (Геометрично) Хвърляме зар докато се падне шестица.
# а) Каква е вероятността да хвърляме не повече от 10 пъти?

# NB За X == 10, подаваме в dgeom(10-1), тъй като той очаква брой неуспехи преди успеха
# P(X<=10) = ?
pgeom(10 - 1, 1/6)

# б) Каква е вероятността да хвърляме поне 6 пъти?
# P(X>=6) = ? = 1 - P(X<=5)
1 - pgeom(5 - 1, 1/6)


#Задача 20. (Отрицателно биномно/биномиално) Хвърляме зар докато се паднат три шестици. Каква е вероятността да хвърляме не повече от 20 пъти?
# NB(r=3, p=1/6), Отрицателно биномно мери броя ходове до К успеха, като всеки опит е независим от предишните 
#    (вероятността му за успех не се влияе от предишния)

# P(X <= 20)
# В R варианта на отрицателно биномно подаваме броя неуспехи, броя успехи и вероятността за успех
pnbinom(20-3, 3, 1/6)


# Задача 21. (Хипергеометрично) Фенерче работи с 2 батерии. Иван има 8 батерии, от които 5 са нови и 3 са изтощени, но не знае кои точно. 
# Ако пробва с 2 случайно избрани батерии, каква е вероятността фенерчето да НЕ заработи?

# P(X=0) + P(X=1)
dhyper(0, 5, 3, 2) + dhyper(1, 5, 3, 2)
# Идеята на хипергеометрично е, че имаме 2 множества - бели(които мерим) и черни топки, като ни вълнува броя подходящи конфигурации от тези 2 множества.
# В случая на dhyper(брой_изтеглени_хубави, брой_хубави(бели), брой_лоши(черни), мощност_на_резултатното_множество), трябва да подадем множества от 2
# елемента, които се съставят от 1 или 0 нови батерии, че да НЕ светне фенерчето



# Задача 22 - Poisson
#Машинописка прави средно по една грешка на всеки 500 думи. На една страница има 300 думи.
#   а) Каква е вероятността да направи не повече от 2 грешки на 5 страници?
#   б) Каква е вероятността да направи между 1 и 3 грешки (включително) на 5 страници?##


n <- 1500
p <- 1/500 # Вероятност за успех на даден опит (в случая да сбърка)

# a)
pbinom(2, n, p)
ppois(2, n*p) # n*p is the mean
# b)
pbinom(3, n, p) - pbinom(0, n, p)
ppois(3, n*p) - ppois(0, n*p)



# Задача 23. На студенти е даден тест от 10 въпроса, всеки с по 4 възможни отговора, един от които е верен. 
#   Иван се явява на теста без да е учил и огражда произволно отговори. Каква е вероятността да е отговорил вярно на поне 5 от въпросите?

1 - pbinom(4, 10, prob=1/4)
1 - sum(dbinom(0:4, 10, prob=1/4)) # Алтернативно може да се сметне всяко P(X=0, X=1,, ..., X=4) и да се сумират


#Задача 24. Авиокомпания е продала 143 билета за самолет, в който има 138 пътнически места. Вероятността пътник да дойде навреме за полета си е 0.92. 
#           Нека приемем, че даден пътник идва навреме независимо от останалите пътниците.
#                а) Каква е вероятността да има място за всички пътници, които са дошли навреме?
#                б) Каква е вероятността да остане едно незаето пътническо място?

# a) P(X <= 138)
pbinom(138, 143, 0.92)
# b) P(X == 137)
dbinom(137, 143, 0.92)


#Задача 25. Батерия, произведена в даден завод, е дефектна с вероятност 0.03. Случайно избрани батерии се взети за проверка.
#           а) Каква е вероятността да се проверят не повече от 10 батерии докато се открие първата дефектна?
#           б) Каква е вероятността измежду първите 50 проверени батерии да има поне 2 дефектни?

faulty_battery_prob <- 0.03
# a) P(X <= 10) => 0..9 дефектни - търсим докато не намерим дефектна, тоест геометрично
pgeom(10 - 1, faulty_battery_prob)
# b) Биномно - правим 50 опита и гледаме колко са дефектни
1 - pbinom(1, 50, faulty_battery_prob)


# Задача 26. В партида от 100 батерии има 3 дефектни. Избрани са 50 батерии за проверка. 
#            Каква е вероятността измежду избраните да има поне 2 дефектни?

# Тъй като вероятността за дефектна се променя при изтеглянето на всяка, това не е биномно, нито отрицателно биномно - а хипергеометрично
# P(X >= 2) = 1 - P(X <= 1)
total_batteries <- 100
faulty <- 3
regular <- total_batteries - faulty
total_drawn_balls <- 50
1 - phyper(2 - 1, faulty, regular, total_drawn_balls)

# Аналогична на горната - забележи, че P(събитието да изтеглим поне 2 дефекти) намалява
# Задача 27. В партида от 3000 батерии има 90 дефектни. Избрани са 50 батерии за проверка. Каква е вероятността измежду избраните да има поне 2 дефектни?
total_batteries <- 3000
faulty <- 90
regular <- total_batteries - faulty
total_drawn_balls <- 50
1 - phyper(2 - 1, faulty, regular, total_drawn_balls)


#Задача 28. За клинично проучване са необходими доброволци, имащи определен ген,който се среща с вероятност 1/10.
#           а) Каква е вероятността да се тестват 5 или повече доброволци докато се намери първия доброволец с въпросния ген?
#           б) Каква е вероятността да се тестват 50 или повече доброволци докато се намерят 10 доброволци с въпросния ген?

gene_prob <- 0.1
# a) Geometric P(X>=5). Тествай трима, то на 4-ти сме с успех, т.е до там проверяваме или pgeom(3, gene_prob) ни гарантира, че е в първите 4
1 - pgeom(5 - 1 - 1, gene_prob) # -1 заради на провали, а не на успех на к-ти опит, -1 заради shift-ването от P(X >= 5) = 1 - P(X <= 4)

# b) Negative Binomial P(X>=50) = 1 - P(X <= 49), т.е до на 49-ти да има успех или 48 провала преди това са се случили (тоест не са се достигнали 10-те души)
1 - pnbinom(48, 10, gene_prob)


# Задача 29. Средно веднъж на 90 дни в софийското метро възниква технически проблем, който води до спиране на движението на влаковете за поне 20 минути. 
#            Каква е вероятността за 360 дни да възникне такъв проблем повече от 3 пъти?

# Думата средно ни влече към Поасоново разпределение, особено що се касае редки събития. 20-те минути за влаковете не ни вълнуват!

# Средно веднъж на 90 дни, проблем => За 360 дни P(Повече от 3 проблема)? => P(X > 3) = ? = 1 - P(X<=3)
lambda_per_90_days = 1 # Ламбда мери брой събития за даден интервал (90 дни)
lambda_per_360_days = lambda_per_90_days * 4 # Скалирай го спрямо интервала, в който ще търсим (360 дни)
1 - ppois(3, lambda_per_360_days)

# Задача 30. Теглим 10 случайно избрани карти от тесте с 52 карти (без връщане). Каква е вероятността да изтеглим поне 2 купи?

# Бих го моделирам като хипергеометрично (вероятността се сменява на база предишното теглене)
# Общо - 52 карти, Купи - 52/4, теглим 10, питаме се поне 2 успеха
# P(X >= 2) = 1 - P(X <= 1)
# Важно - хипергеомертично приема (търсен_брой_успехи, брой_потенциални_успехи, брой_потенциални_неуспехи, брой_опити)
# Тоест НЕ ПОДАВАМЕ в него общия брой карти, а го цепим на 2-те множества - {купи, некупи}
cards <- 52
hearts <- cards / 4
other_cards <- cards - hearts
drawn <- 10
hearts_searched_count <- 2
1 - phyper(hearts_searched_count - 1, hearts, other_cards, drawn)


# Задача 31. Теглим 10 пъти по една случайно избрана карта от тесте с 52 карти (с връщане). Каква е вероятността да изтеглим поне 2 купи?

# Понеже връщаме, то вероятността за успех не се променя, тоест можем да си го представим като Биномно
# P(X >= 2) = 1 - P(X <= 1)
1 - pbinom(1, drawn, hearts / cards)
