#Задача 32. Генерирайте 500 случайни числа от равномерно разпределение в интервала (3 5). 
#           Начертайте хистограма на генерираните числа и на същата картинка добавете графика 
#           на плътността на случайна величина X ∼ U(3, 5). Повторете същото с 5000 случайни числа.
numbers <- runif(500, 3, 5)
hist(numbers, probability = TRUE)
curve(dunif(x, 3, 5), from = 3, to = 5, add=TRUE, lwd=2.5)

numbers <- runif(5000, 3, 5)
hist(numbers, probability = TRUE)
curve(dunif(x, 3, 5), from = 3, to = 5, add=TRUE, lwd=2.5)
# “control + shift + C” върху маркирани множество линии, за да се закоментират те



# Задача 33. Генерирайте 500 случайни числа от експоненциално разпределение с параметър lambda = 1/7.
#            Начертайте хистограма на генерираните числа и на същата картинка добавете
#            графика на плътността на случайна величина X ∼ Exp( = 1 7). Повторете същото с 5000 случайни числа.

count <- 500
lambda <- 1/7
numbers <- rexp(count, lambda)
hist(numbers, probability = TRUE)
curve(dexp(x, lambda), from = 0, max(numbers), add=TRUE, lwd=2.5)

count <- 5000
numbers <- rexp(count, lambda)
hist(numbers, probability = TRUE)
curve(dexp(x, lambda), from = 0, max(numbers), add=TRUE, lwd=2.5)



# Задача 34. Генерирайте 500 случайни числа от нормално разпределение с параметри
#            m=0 sd=1.Начертайте хистограма на генерираните числа и на същата картинка добавете
#            графика на плътността на случайна величина X ∼ 𝒩( = 0 = 1). Повторете същото с 5000 случайни числа.
count <- 500
mean <- 0
sd <- 1
numbers <- rnorm(count, mean, sd)
hist(numbers, probability = TRUE)
curve(dnorm(x, mean, sd), add=TRUE, lwd=2.5)

count <- 500
numbers <- rnorm(count, mean, sd)
hist(numbers, probability = TRUE)
curve(dnorm(x, mean, sd), add=TRUE, lwd=2.5)



# Задача 35. За n = 200 и n = 1000 генерирайте данни x1,x2..,xn от равномерно разпределение в интервала (7, 9). 
#           Начертайте емпиричната функция на разпределение на данните. 
#           На същата картинка добавете функцията на разпределение на случайна величина X ∼U(7 9).
n <- 200
lower_limit <- 7
upper_limit <- 9
generated_numbers <- runif(n, lower_limit, upper_limit)

plot.ecdf(generated_numbers, do.points=FALSE) # Това е емпиричната функция на разпределние по подадените точки
curve(punif(x, lower_limit, upper_limit), add=TRUE, lwd=2)

n <- 1000 # Апроксимацията е значително по-добра
generated_numbers <- runif(n, lower_limit, upper_limit)
plot.ecdf(generated_numbers, do.points=FALSE)
curve(punif(x, lower_limit, upper_limit), add=TRUE, lwd=2)



# Задача 36. За n = 200 и n = 1000 генерирайте данни x1,x2..,xn от експоненциално разпределение с параметър = 3. 
#            Начертайте емпиричната функция на разпределение на данните. 
#            На същата картинка добавете функцията на разпределение на случайна величина X ∼Exp( =3).
n <- 200
lambda <- 3
generated_numbers <- rexp(n, lambda)

plot.ecdf(generated_numbers, do.points=FALSE)
curve(pexp(x, lambda), add=TRUE, lwd=2)

n <- 1000
generated_numbers <- rexp(n, lambda)
plot.ecdf(generated_numbers, do.points=FALSE)
curve(pexp(x, lambda), add=TRUE, lwd=2)



# Задача 37. За n =200 и n=1000 генерирайте данни x1,x2..,xn от нормално разпределение с параметри m=4, sd=1.2 
#            Начертайте емпиричната функция на разпределение на данните. 
#            На същата картинка добавете функцията на разпределение на случайна величина X ∼𝒩( =4 =12).
n <- 200
mean <- 4
sd <- 1.2
generated_numbers <- rnorm(n, mean, sd)

plot.ecdf(generated_numbers, do.points=FALSE)
curve(pnorm(x, mean, sd), add=TRUE, lwd=2)

n <- 1000
generated_numbers <- rnorm(n, mean, sd)
plot.ecdf(generated_numbers, do.points=FALSE)
curve(pnorm(x, mean, sd), add=TRUE, lwd=2)



# Задача 38. Нека X ∼U(7 9). Изобразете на графика плътността, функцията на разпределение и квантилната функция на X.
lower_limit <- 7
upper_limit <- 9
par(mfrow=c(1,3)) # задава да можем да чертаем отделни графики - в 1 ред и 3 колони
curve(dunif(x, lower_limit, upper_limit), from=lower_limit, to=upper_limit, lwd=2)
curve(punif(x, lower_limit, upper_limit), from=lower_limit - 2, to=upper_limit + 2, lwd=2)

# Забележи, че на квантилната фунцкия се подават вероятност, както и същите граници на равномерно, както е за плътностната функция и функцията на разпределение
# независимата ѝ променлива е в [0, 1] вероятност, но нейния образ е в [7,9]. Тоест from и to задават граници на x, докато параметрите към
# функциите dunif, punif, qunif се занимават с това, до къде може да приема стойности случайната величина!
curve(qunif(x, lower_limit, upper_limit), from=0, to=1, lwd=2)



# Задача 39. Нека X ∼ Exp(lambda=3). Изобразете на графика плътността, функцията на разпределение и квантилната функция на X.
lambda <- 3
curve(dexp(x, lambda), lwd=2)
curve(pexp(x, lambda), lwd=2)
curve(qexp(x, lambda), from=0, to=1, lwd=2)



# Задача 40. Нека X ∼𝒩(mean=4, sd=1.2). Изобразете на графика плътността, функцията на разпределение и квантилната функция на X.
mean <- 4
sd <- 1.2
curve(dnorm(x, mean, sd), from=0, to=8, lwd=2)
curve(pnorm(x, mean, sd), from=0, to=8, lwd=2)
curve(qnorm(x, mean, sd), from=0, to=1, lwd=2)
par(mfrow=c(1,1)) # нека си върнем фабричното показване на графики (1 ред и 1 колона)



# Задача 41. Количеството (в мл) на портокалов сок в случайно избрана бутилка, произведена от дадена компания, 
#            е случайна величина, която има равномерно разпределение в интервала (495, 502).
#         а) Намерете вероятността в случайно избрана бутилка да има повече от 500 мл сок.
#         б) Нека v e такова, че с вероятност 0.8 в случайно избрана бутилка има поне v мл сок. Намерете стойността на v.

min <- 495
max <- 502
# a) P(X > 500) = 1 - P(X <= 500)
1 - punif(500, min, max)

# b) v = ? : p=0.8 да има сок
# Ще използваме квантилна функция P(X > v) = 0.8 или P(X <= v) = 0.2
prob <- 0.8 # С такави сигурност трябва да има поне толкова сок !
qunif(1 - prob, min, max) # Понеже qnif е обратна функция на punif, то работят с интервал X <= стойност, тоест = 1 - не



# Задача 42. Времето (в години) до повреда на пералня от даден модел е случайна величина X, 
#            която има експоненциално разпределение с параметър lambda = 1/4.
# а) Намерете вероятността пералня от този модел да не се повреди през първите 3 години.
# X = "живот на пералня в години", P(X > 3) = 1 - P(X <= 3)
lambda <- 1/4
1 - pexp(3, lambda)

# б) Намерете вероятността пералня от този модел да се повреди през първите 2 години.
pexp(2, lambda)

# в) Ако пералня е работила без повреда 3 години, каква е вероятността да работи без повреда още 3 години?
# 3 години без повреда и още 3 години без повреда са 6 години без повреда (безпаметност! -> не се интересува как е работила през миналите 3 години)
# P(X > 6) = 1 - P(X <= 6)
1 - pexp(6, lambda)

# г) Намерете t, за което P(X ≤ t) = 0.90
# Сега няма да се питаме за вероятност, а за време, тоест квантилна функция, като искаме да сме по-малки с вероятност 0.9 => не е 1-p (за по-големи), а си е p в квантила
qexp(0.9, lambda)



#Задача 43. Количеството (в кг) кашкавал, което се изразходва в дадена пицария за една седмица, 
#            е нормално разпределено с параметри mu=41, sd=5.
mean <- 41
sd <- 5
#  а) Каква е вероятността в произволно избрана седмица пицарията да изразходи над 51кг кашкавал?
# P(X > 51) = 1 - P(X <= 51)
1 - pnorm(51, mean, sd)

#  б) Каква е вероятността в произволно избрана седмица пицарията да изразходи между 45 и 50 кг кашкавал?
# !!!!! Внимание за границите!
# P(45 <= X <= 50) = P(X <= 50) - P(X <= 45), !!! пишем го 45 в непрекъснати разпределния, понеже вероятността за попадане в точка е -> 0
# За целите ни това е същото като P(X < 50) - P(X < 45), все тая е дали пишем равно, важно е долната граница да е 45, а не 44, както бихме направили в дискретните разпределения
pnorm(50, mean, sd) - pnorm(45, mean, sd)

#  в) Колко кашкавал трябва да има в запас в дадена седмица, така че да е достатъчно с вероятност 0.99?
qnorm(0.99, mean, sd) # 0.99, а не 0.01 понеже се питаме колко кашкавал да вземем, така че изразходваното количество (случайната величина) да е по-малка от него с P=0.99


# TODO tasks 44,45,46,47,48
