# Задачи с Централна гранична теорема

# Задача 65. Времето на живот на електрическа крушка от даден тип има експоненциално
#   разпределение със средно 900 часа. Измерено е времето на живот на 100 случайно избрани
#   крушки. Каква е вероятността полученото средно време да е над 980 часа?

# Xi ~ Exp(lambda), E(Xi) = 1/lambda = 900, D(Xi) - 1/lambda^2, sd(Xi) = sqrt(1/lambda^2)

# E(X) = 1/100(X1 + ... + X100),
# P(E(X) > 980) = 1 - P(E(X) <= 980) =ЦГТ= 1 - P( (E(X) - mu)/(sd/sqrt(n)) <= (980 - mu)/(sd/sqrt(n)))
# Заместваме с мю, стандартното отклонение и n. Нещото отдясно на '<=' e число, а вляло е случайна величина с нормално разпределние с (0, 1)
mu <- 900
lambda <- 1 / mu
sd <- sqrt(1 / lambda^2)
number_of_random_variables <- 100
searched_value <- 980

right_limit <- (searched_value - mu) / (sd / sqrt(number_of_random_variables))
1 - pnorm(right_limit)



# Задача 66. Времето на чакане (в секунди) на асансьор в сграда е равномерно разпределено в интервала (0, 60). 
#   Ако засечем времето на чакане на 50 човека, каква е вероятността полученото средно време да е между 25 и 35 секунди?

# Xi ~ Unif(0, 60) = "времето за чакане на асансьор от човек i", X1, X2, ... Xn са независими и еднакво разпределени,
# търсим им средно време, тоест можем да приложим ЦГТ

# P(25 <= E(X) <= 35) = ? = P(E(X) < 35) - P(E(X) < 25)
# E(X) = 1/n(X1 + ... + Xn) = 1/50(X1 + ... + X50)
a <- 0
b <- 60
n <- 50
mu <- (b - a) / 2
sd <- sqrt(1/12 * (b - a)^2)

# P(E(X) < 35), трябва да си го допишем до нормално разпределние (-mu на двете страни)
# P(E(X) - mu < 35 - mu)   # / (sd/sqrt(n))
# P((E(X) - mu) / (sd/sqrt(n)) < (35 - mu) / (sd/sqrt(n))), заместваме със стойностите. Аналогично за P(E(X) < 25)

right_limit <- (35 - mu)/(sd/sqrt(n))
left_limit <- (25 - mu)/(sd/sqrt(n))
pnorm(right_limit) - pnorm(left_limit)



# Задача 67. Броят на стафидите в една кифличка, произведена в дадена пекарна, 
#   е случайна величина със следното разпределение: 4=0.2, 5=0.4, 6=0.3, 7=0.1
#  Направена е извадка от 49 кифлички и са преброени стафидите във всяка. 
#  Каква е вероятността полученият среден брой стафиди да е над 5.5?

n <- 49
searched_value <- 5.5
X <- c(rep(4, 2), rep(5, 4), rep(6, 3), rep(7, 1)) # образуваме си наблюденията на 1 сл. вел.
mu <- mean(X)
sd <- sd(X)

# X1, ...., X49 са независими и еднакво разпределни, питаме се за среден брой, ще използваме ЦГТ
# P(E(X) > 5.5) = 1 - P(E(X) <= 5.5)  / - mu
# P((E(X) - mu) / (sd/sqrt(n)) <= (5.5 - mu / (sd/sqrt(n)))) / (sd/sqrt(n))
right_limit <- (searched_value - mu) / (sd / sqrt(n))
1 - pnorm(right_limit)



# Различна от предишните
#Задача 68. Регистрираният багаж на пътниците в даден самолет не трябва да надвишава общо 4000 кг. 
#  Количеството регистриран багаж на произволно избран пътник е случайна величина със средно 24 кг и 
#  стандартно отклонение 7 кг. Каква е вероятността общото количество регистриран багаж 
#  в самолет със 160 пътници да надвиши 4000 кг?

# Важният момент в задачата спрямо предишните е да се усетим, че тук X е сума на случайни величини, а не тяхно средно
# Тоест няма да използваме ЦГТ с формулата за средно на сл. вел., а със сума!!!

n <- 160
mu <- 24
sd <- 7
searched_value <- 4000
# P(E(X) > 4000) = 1 - P(E(X) <= 4000)
# Понеже е сума, то трябва да извадим n пъти средното на 1 сл. вел.
# Както и да разделим на стандартното отклонение * корен от бройката

right_limit <- (searched_value - mu * n) / (sd * sqrt(n))
1 - pnorm(right_limit)



# Задача 69. Броят на поръчките, постъпващи за ден в дадена фирма, има Поасоново разпределение със средно 5. 
#   Нека X1, ..., X80 са поръчките в 80 случайно избрани дни. Намерете P(4.5 < E(X) < 5.5).

# Xi ~ Poi(lambda), E(X) = 5 = lambda, D(X) = lambda
mu <- 5
sd <- sqrt(5)
n <- 80
# E(X) = 1/n(X1 + ... + Xn), търсим средно колко поръчки са дошли, на база което вероятност да са между 4.5 и 5.5
# P(4.5 < E(X) < 5.5) = P(E(X) < 5.5) - P(4.5 < E(X)), прилагаме ЦГТ за среден брой => (-mu / (sd / sqrt(n)) ) на двете страни

right_limit <- (5.5 - mu) / (sd / sqrt(n))
left_limit <- (4.5 - mu) / (sd / sqrt(n))
pnorm(right_limit) - pnorm(left_limit)