# Фирма произвежда електрически крушки. Средното време на живот на една крушка е 2000 часа със стандартно отклонение 300 часа. 
# Предложен е нов тип крушки. Изпробвани са 100 крушки от новия тип. Резултатите показват средно време на живот
# на новите крушки 2100 часа и същото стандартно отклонение. 
# Може ли да се твърди, че средното време на живот на новия тип крушки е повече от 2000 часа?

# Не знаем средно, искаме да го докажем (z-test за средно с 1 извадка)
# ! Хипотезата ни идва от въпроса и винаги проверяваме в H0 дали е равен
# mu_zero = 2000

# Х1, Х2, ..., Х100 нови крушки с mu=E(Xi).
# mean_observed = 2100, n = 100, sd = 300
# zobs е с хипотезата и наблюдението, Z е случайна нормално разпределена величина

# цгт (Z >= zobs),
observed_mean <- 2100
n <- 100
sigma <- 300
mu_zero <- 2000
z_observed <- (observed_mean - mu_zero) / (sigma / sqrt(n)) # Това е винаги така - просто приема наблюдавания резулат и хипотезата

# Понеже се питаме P(Z >= z_obs) = 1 - P(Z <= z_obs), а Z ~ N(0, 1)
p_value <- 1 - pnorm(z_observed)
p_value # Ако p_value e < алфа (0.05), то охврърляме хиптезата 0.0004290603
# Отхвърляме хипотезата mu, като имаме основание да твърдим, че средното време на живот е повече от 2000 часа



#Задача 8.2. Според исторически данни, средната киселинност на дъждовете в определен индустриален район е 5.2 
# За да се провери има ли изменение в тази стойност е измерена киселинността на 12 валежа през изминалата година. 
# Получени са следните резултати:
#  6.1 5.4 4.8 5.8 6.6 5.3 6.1 4.4 3.9 6.8 6.5 6.3
# От предишни изследвания е известно, че киселинността на валежите има нормално разпределение. 
# Имаме ли основания да твърдим, че киселинността в района се е променила в сравнение с историческите данни.

x <- c(6.1, 5.4, 4.8, 5.8, 6.6, 5.3, 6.1, 4.4, 3.9, 6.8, 6.5, 6.3)
n <- length(x)
mu_zero <- 5.2 # не знаем нито средното, нито дисперсията на данните, правим предположение за средното (t-тест)
t_observed <- (mean(x) - mu_zero) / (sd(x) / sqrt(n))
t_observed

# 2 начина за намиране на p_value при търсене на различна стойност на mu

# От 1 страна търсим 2 интервала P(T >= |t_obs|) и P(T <= -|t_obs|)
# Това цялото може да се изрази като единица - лицето между тези 2 точки =>
# 1 - ( P(T <= |t_obs|) - P(T <= -|t_obs|) ) = 1 - средата
1 - pt(abs(t_observed), n - 1) + pt(-abs(t_observed), n - 1)
# !!! Защо има модули - тъй като не е ясно кое е за дясната и кое за лявата точка - ако ги разменим вероятността ще надхвърли единица,
# модулите ни гарантират, че това няма да се случи!

# От друга страна лицето под функцията оградено от края на левия интервал до -|t_obs| е равно на лицето под функцията 
#    от десния край до |t_obs|. Така просто можем да вземем единия край и да го умножим по 2 - избираме десния, тъй като символите са по-малко около стойността
2 * (1 - pt(abs(t_observed), n - 1))

# Нека пробваме с вгранета t.test функция в R
t.test(x, mu=mu_zero)

t.test(x, mu=mu_zero)$p.value # 0.1069226
# Понеже вероятността да наблюдаваме стойностите е по-голяма от алфа (0.05) при тази хипотеза H0, то нямаме основание да я отхвърлим,
# т.е средната киселинност на дъждовете в района не можем да кажем, че се е променила


# Задача 8.3. Известно е, че при 10% от колите от дадена марка се появява сериозен дефект по време на гаранционния срок. 
#        От първите 25000 продадени коли от нов модел, 2700 се оказали с дефект. 
#        Може ли да се твърди, че вероятността в кола от новия модел да се появи дефект не е 10%?

p_zero = 0.1
n <- 25000
x <- 2700 # defected (sum of passed Bernoulli trials)
# Хипотезата ни е да е 10% (H0), H1 е да не е 10%
z_obs <- (x / n - p_zero) / sqrt( (p_zero * (1 - p_zero) ) / n)
# Не е 10%, означава да търсим различна, т.е 2 * P(Z >= |z_obs|) = 2 * (1 - P(Z <= |z_obs|))
p_value <- 2 * (1 - pnorm(abs(z_obs)))
p_value # 2.482661e-05
# Понеже p_value < 0.05, то е малко вероятно да се наблюдават тези стойности при такава фиксирина хипотеза, т.е отхвърляме хипотеза H0 в полза на H1
# Можем да твърдим, че вероятността за дефект в новия модел е различна от 10%

# Алтернативно го проверяваме с prop.test
prop.test(x=x, n=n, p=p_zero, correct = FALSE)$p.value


# Обратно на истинските задачи за хипотези върху 1 извадка

# Задача 70 и 71
# Проведен е експеримент с монета. Според резултатите, при 100 хвърляния на монетата 
#  се паднало ези K пъти. Може ли въз основа на тези данни да се заключи, че
#  вероятността да се падне ези при хвърляне на тази монета е повече от 1/2?
# a) K = 58
# b) K = 61

# Имаме бернулиеви опити, които са независими и анализираме сумата им. Вероятността търсим (z-тест за пропорция)
p_zero <- 0.5
n <- 100
normalizer <- sqrt(p_zero * (1 - p_zero) / n)
# a)
x <- 58
z_obs <- (x / n - p_zero) / normalizer # за да не изчисляваме знаменателя два пъти
# Повече от 1/2 означава H0: p=1/2, H1: p>1/2
# P(Z > z_obs) = 1 - P(Z <= z_obs)
p_value <- 1 - pnorm(z_obs)
p_value # 0.05479929 > 0.05, тоест не е малко вероятно с тази хипотеза да се получи такова отклонение от данните => запазваме началната хипотеза

# b)
x <- 61
z_obs <- (x / n - p_zero) / normalizer
p_value <- 1 - pnorm(z_obs)
p_value # 0.01390345 < 0.05, т.е е малко вероятно с тази хипотеза да се получи такова реално отклонение =>
# Отхвърляме хипотеза H0 в полза на алтернативната H1 => имаме основание да твърдим, че P({пада се ези}) > 1/2



# Задача 72 и 73
# Машина произвежда топки за тенис. Твърди се, че диаметърът на топка, произведена от машината, има нормално разпределение 
# със средно mu=6.7 см и стандартно отклонение sd=0.12 см. Измерен е диаметърът на 45 случайно избрани топки, произведени
# от машината. Средният диаметър на избраните топки е K см. 
# Подкрепят ли тези данни, твърдението, че средният диаметър на топките, произведени от машината, е 6.7 см?

# Търсим среден диаметър (очакване), при положение, че знаем стандартно отклонение => z-тест за средно
sigma <- 0.12
mu_zero <- 6.7
n <- 45
# H0 = {Средният диаметър на топките = 6.7см}, H1 = {Средният диаметър е различен от 6.7см} = H0^C

# a) K = 6.73
x <- 6.73
z_obs <- (x - mu_zero) / (sigma / sqrt(n))
# P(X <= -|z_obs| U X >= |z_obs|) = 2*P(X >= |z_obs|) = 2(1 - P(X <= |z_obs|))
p_value <- 2 * (1 - pnorm(z_obs))
p_value # 0.09353251 > 0.05 => нямаме основание да си сменим първоначалната хипотеза H0

# b) K = 6.76
x <- 6.76
z_obs <- (x - mu_zero) / (sigma / sqrt(n))
p_value <- 2 * (1 - pnorm(z_obs))
p_value # 0.0007962302 < 0.05 => Малко вероятно да наблюдаваме такова отклонение при такова средно, 
#       т.е можем да отхвърлим H0 в полза на H1 или да кажем, че средният диаметър на втората извадка топки е наистина различен от 6.7



# Задача 74. Кадмият е тежък метал, който може да се натрупа до високи нива в гъбите.
# Измерена е концентрацията на кадмий в случайна извадка от 10 горски гъби събрани в дадена местност. Резултатите са следните (в мг/кг):
#   3.1 3.0 3.7 2.6 4.2 3.8 3.6 2.7 3.8 4.4
# Може да предположим, че концентрацията на кадмий е нормално разпределена. 
# Имаме ли основание да твърдим, че средната концентрация на кадмий в горските гъбите в дадената местност е по-малко от 4 мг/кг?

# Търсим средно, не знаeм дисперсия, нито средно (имаме предположение за него). Ще използваме t-тест (въпреки, че извадката е малка
# условието, Xi са нормално разпределни ни покрива, т.е можем да приложим ЦГТ и ще се сведе до т-разпределние съвкупността им)

x <- c(3.1, 3.0, 3.7, 2.6, 4.2, 3.8, 3.6, 2.7, 3.8, 4.4)
n <- length(x)
mu_zero <- 4
t_obs <- (mean(x) - mu_zero) / (sd(x) / sqrt(n))
# е по-малко от 4 мг/кг => P(T <= t_obs), нулева хипотеза е =, алтернативната е по-малка
p-value <- pt(t_obs, n - 1) 
p-value # 0.01372013 < 0.05, така че можем да твърдим, че концентрацията на кадмий в извадката е наистина по-малка от 4 мг/кг



# Задача 75. Проведен е експеримент, при който 58 домашни гълъба са пуснати на свобода от непознато място, 
# което е на разстояние 106 км от дома им. От тях 32 намерили пътя към дома си. Преди провеждане на експеримента 
# изследовател твърдял, че домашните гълъби намират пътя към дома си с вероятност над 51%. 
# Подкрепят ли данните твърдението на изследователя?

# Разстоянието от горното е без значение, важното е каква е успеваемостта. Искаме да потвърдим вероятност.
# Всеки опит с гълъбите е сл. вел. Xi ~ Ber(p), така че те са независими и еднакво разпределени. Можем да приложим z-тест за пропорция
n <- 58
x <- 32 # Ще приложим ЦГТ, имаме поне 30 кандидата в разпределение с леки опашки
p_zero <- 0.51
variance <- p_zero * (1 - p_zero) 
z_obs <- (x / n - p_zero) / ( sqrt(variance / n) )
# P(Z >= z_obs) = 1 - P(Z <= z_obs)
p-value <- 1 - pnorm(z_obs)
p-value # 0.2625022 > 0.05, така че няма причина да отхвърлим хипотезата, 
#                че гълъбите намират дома си с вероятност не по-голяма от 51%



# Задача 76. Измерено е нивото на хемоглобин на 10 деца страдащи от специфична болест. Данните са:
#   12.3 11.2 14.2 15.3 14.8 13.5 11.1 15.1 15.4 13.2
# Считаме, че нивото на хемоглобин има нормално разпределение.
#  а) Имаме ли основание да твърдим, че средното ниво на хемоглобин при децата 
#           страдащи от тази болест е различно от нормалното ниво от 14.6?
#   б) Имаме ли основание да твърдим, че средното ниво на хемоглобин при децата страдащи от тази болест е по-малко от 14.6?

# Имаме измервания от нормално разпределение, търсим средно, не знаем дисперсия => t-тест за средно
x <- c(12.3, 11.2, 14.2, 15.3, 14.8, 13.5, 11.1, 15.1, 15.4, 13.2)
n <- length(x)
mu_zero <- 14.6
t_obs <- (mean(x) - mu_zero) / (sd(x) / sqrt(n))

# a) P(Z != t_obs) = P(Z <= -|t_obs| U Z >= |t_obs|) = 2 * P(Z >= |t_obs|) = 2 * (1 - P(Z <= |t_obs|)
p_value <- 2 * (1 - pt(abs(t_obs), n - 1))
p_value # 0.08773213 > 0.05 => нямаме основание да твърдим, че средното ниво на хемоглобин е различно от 14.6

# Напомням, че е удобно: t.test(x, mu=14.6)$p.value # и параметър alternative="", вместо да си пишем ние наблюдавните стойности

# b) P(Z <= t_obs)
p_value <- pt(t_obs, n - 1)
p_value # 0.04386607 < 0.05 => Имаме достатъчно основание да отхвърлим нулевата хипотеза в полза на твъдението, че децата,
#         страдащи от тази болест, имат по-малко хемоглобин от 14.6

#!!! => Интересен парадокс се получи - Нямахме основание да твърдим, че нивото е различно от 14.6, но имаме основание да твъдим, че е по-малко от 14.6



# Задача 77. Според проучване от 2009 година, около 7.5% от стоките в даден хипермаркет имат грешна цена на етикета. 
# През 2010 е направено ново проучване и от 200 случайно избрани стоки, 14 били с грешна цена.
# а) Имаме ли основание да твърдим, че през 2010 вероятността стока да е с грешна цена е различна от 7.5%?
# б) Имаме ли основание да твърдим, че през 2010 вероятността стока да е с грешна цена е по-малка от 7.5%?

# Търсим вероятност за случване на събитие (като то мери N бернулиеви такива) => z-тест за пропорция
p_zero <- 7.5 / 100
n <- 200
x <- 14

# a)
p_value <- prop.test(x, n, p_zero, alternative = "two.sided", correct = FALSE)$p.value
p_value # 0.7883434 > 0.05 => Нямаме основание да твърдим, че цената на стоката е грешна
# b)
p_value <- prop.test(x, n, p_zero, alternative = "less", correct = FALSE)$p.value
p_value # 0.3941717 > 0.05 => Не е малко вероятно отклонението от данните да дойде на база тази вероятност => нямаме основание
#       да отхвърлим хипотезата си

# Алтернативно може да се реши с z-тест и z-obs
z_obs <- (x/n - p_zero) / ( sqrt(p_zero * (1- p_zero) / n) )
# a)
p_value <- 2 * (1 - pnorm(abs(z_obs)))
# b)
p_value <- pnorm(z_obs) # Същите стойности се получават като горните, горното е по-бързо, тъй като не правим ние теста



# Задача 78. Измерена е дължината на дясното ухо на 66 случайно избрани жени на възраст между 18 и 30 години. 
# Резултатите показват средна дължина 61.9 мм и стандартно отклонение 4 мм. Нека предположим, че популационната дисперсия е 
# известна и VAR = (4.1)^2. Имаме ли основание да твърдим, че средната дължина на 
# дясното ухо на жените на възраст между 18 и 30 години е различна от 60 мм?

# Търсим средна дължина, дадена и дисперсия (фиксирина), имаме множество независими и еднакво разпределни случайни величини
# Бройката е добра (над 30), така че прилагаме ЦГТ и z-тест за средно
n <- 66
mu_zero <- 60
sigma <- 4.1
mu_real <- 61.9

z_obs <- (mu_real - mu_zero) / (sigma / sqrt(n))
# P(Z != z_obs) = 2 * (1 - P(Z <= |z_obs|))
p_value <- 2 * (1 - pnorm(abs(z_obs)))
p_value # 0.0001666836 < 0.05 => Имаме основание да отхвърлим хипотеза H0{средната дължина на ухоте е равна на 60 мм}
# в полза на алтернативата H1{средната дължина на ухото е различна от 60мм}



# Задача 79. Според производител на автомат за безалкохолни напитки, средното количество, което налива автоматът в една чаша 
#   е 170 грама със стандартно отклонение 3.9грама. За да се провери това, е измерено количеството течност при 50 наливания. 
#   Резултатите показват средно 168 грама и същото стандартно отклонение. 
#   Може ли да се твърди,че в средно автоматът налива по-малко от 170 грама?

# Търсим средно да заключим при фиксирана дисперсия (стандартно отклонение) => прилагаме z-тест за средно върху X1...Xn i.i.d случайни величини
n <- 50 # Достатъчно добра цифра е за ЦГТ
sigma <- 3.9
mu_zero <- 170
mu_observed <- 168

z_obs <- (mu_observed - mu_zero) / (sigma / sqrt(n))
# P(Z <= z_obs)
p_value <- pnorm(z_obs) 
p_value # 0.0001438176 < 0.05 и имаме основание да твърдим, че автоматът не налива 170 грама, както е H0, а напротив, налива по-малко H1