# !Задачите за 2 извадки се базират на подобни идеи като тези върху 1 извадка, само че формулите за z_observed/t_observed значително натежават
# !Препоръчвам да се използват готовите функции в R - t.test() -> за разлика на средните и prop.test() за разлика на пропорции
# Иначе степените на свобода в първото и формулата за Z с P шапка във второто са сложните части, където човек може да допусне неволна грешка поради неправилно скобуване

#TASK 80 - имат зареждане на данни, ще се правят на по-късен етап
#TASK 81 TODO



# Задача 82. Направена е извадка от 200 болта, произведени от машина А и 200 болта, произведени от машина В. 
#   Дефектни се оказали 8 болта произведени от първата машина и 15 болта произведени от втората. Може ли да 
#   се твърди, че двете машини се различават по отношение на вероятността да произведат дефектен болт?

# 200 болта А и 200 болта Б => 2 извадки
# Вероятност за равенство между 2 извадки мерим с z-test за разлика на пропорции

# !За изпълнение върху 1 извадка се подава директно стойността благоприятни и общия брой тестове -> тук подаваме вектори с тях
x <- c(8, 15)
n <- c(200, 200) # !ЗАДЪЛЖИТЕЛНО x и n са вектори с еднаква размерност! (вектор с 1 стойност се приема за скалар btw)
# !Точно поради приемането си за скалар, то функции в R, които очакват вектори, могат да работят и със скалари

# H0: p1 = p2
# H1: p1 != p2 // различават им се вероятностите за производство на дефектен болт

# Очевидно X1, X2 са Bin(n, pi): i = {1,2}, т.е можем да приложим върху тях теста за пропорция. Още повече, че щом n > 30, апроксимацията е добра (ЦГТ)
p_value <- prop.test(x, n, correct = FALSE, alternative = "two.sided")$p.value
p_value # 0.1327191 > 0.05, поради което запазваме хипотеза H0 - нямаме достатъчно основания да твърдим, че
# вероятността двете машини да произведат дефектен болт е различна



# Задача 83. За всеки от следните случаи посочете, дали данните представляват двойки наблюдения (зависими) или са две независими извадки:
#   1) Избрани са 50 стоки, продавани в магазин за електроуреди, и за всяка стока е записана цената в магазин A и цената в магазин B.

#      -> Двойки наблюдения, понеже тестовете(извадките) са върху едни и същи модели електроуреди, само условията (магазин А/Б) са различни


#   2) За да се сравнят две марки електрически крушки е направен експеримент с по 65 крушки от 
#      всяка марка и е записано времето до изгаряне на всяка от крушките.

#      -> Независими са, понеже крушките от едната марка по нищо не зависят от крушките на другата - единственото общо е, че са тип крушка


#   3) Оценките от първото и от второто контролно по Увод в програмирането на студентите от специалност КН.

#      -> Двойки наблюдения, понеже тестват знанията на 1 и същи ученици (обекти) - студентите от специалност КН в различни аспекти(КР1 и КР2)

#   4) Оценките по Дискретни структури на студентите от първа и от втора група от специалност КН.

#      -> Малко е спорно, понеже може да се каже, че хората се тестват върху 1 и същи материал, тоест оценките зависят от групата, НО
#         самите индивиди от група 1 дават независими резултати за себе си спрямо студентите от група 2 - с нищо не си корелират


# Задача 84. Генерирайте данни x1, x2, ..., xn от 𝒩(mu=5, sd^2 = 1) и данни y1, y2, ..., yn от 𝒩(mu=5, sd^2=0.64).
# Проверете хипотезата за равенство на средните. Повторете 10000 пъти за n={20, 50, 100, 500}. 
# В каква част от случаите нулевата хипотеза се отхвърля?

# Тест за средни с 2 независими извадки (генерират се независимо една от друга)
sim_t_test_2_samples <- function(n, mu1, mu2, sd1, sd2) {
  x <- rnorm(n, mu1, sd1)
  y <- rnorm(n, mu2, sd2)
  # Ho: mu_x = mu_y
  # H1: mu_x != mu_y
  t.test(x, y)$p.value # по-подразбиране работи с two.sided и независими извадки
}

prob_t_test_2_samples <- function(trials, n_vector, acceptance_criteria, mu1, mu2, sd1, sd2) {
  n_len <- length(n_vector)
  percentage_vector <- numeric(length = n_len) # по-бързо е отколкото да прилепяме стойността към нов вектор
  index <- 1
  while (index <= n_len) {
    n <- n_vector[index]
    rs <- replicate(trials, sim_t_test_2_samples(n, mu1, mu2, sd1, sd2))
    percentage_vector[index] <- sum(rs <= acceptance_criteria) / trials # на всеки индекс за n=i, ще каже в колко % Ho се е отхвърлила
    index <- index + 1
  }
  percentage_vector
}

mu <- 5
n_vector <- c(20, 50, 100, 500)
prob_t_test_2_samples(trials = 10000, n_vector, acceptance_criteria = 0.05, mu1 = mu, mu2 = mu, sd1 = 1, sd2 = 0.8)
# 0.0521 0.0487 0.0504 0.0478, т.е съответно в 5.21, 4.87, 5.04, 4.78 процента от случаите Ho се е отхвърлила за съответно n={20, 50, 100, 500}



# Задача 85. Генерирайте данни x1, x2, ..., xn от 𝒩(mu=5, sd^2=1) и данни y1, y2, ... ,yn от 𝒩(mu=5.2, sd^2=1).
# Проверете хипотезата за равенство на средните. 
# Повторете 10000 пъти за n={20, 50, 100, 500, 1000}. В каква част от случаите нулевата хипотеза се отхвърля?

# Аналогична на горната, просто сега сме разменили очакването да е различно, а не дисперсията, както и имаме още 1 стойност за n=1000
sigma <- 1
n_vector <- c(20, 50, 100, 500, 1000)
prob_t_test_2_samples(trials = 10000, n_vector, acceptance_criteria = 0.05, mu1 = 5, mu2 = 5.2, sd1 = sigma, sd2 = sigma)
# 0.0869 0.1638 0.2897 0.8879 0.9928, т.е съответно в 8.69, 16.38, 28.97, 88.79, 99.28 процента от случаите Ho се е отхвърлила за съответно n={20, 50, 100, 500, 1000}

# => Тълкувание на задачи 84 и 85. Питаме се, дали очакването(средното) на X == с това на Y. То би било такова, ако mu_1 == mu_2.
# В 84 дисперсията е различна, тоест съществува различна вероятност за сгъстяване на точките (отделните), но центърът пак е в mu=5. 
# Тоест дори при големи n, равенството е малко вероятно да отхвърлим

# В 85 задача шумът на двете сл. вел. е еднакво голям, но центърът им е различен => затова при големи N т-тестът отчита, 
# че е по-вероятно да отхвърлим равенството (Ho), даже накрая си клони към почти сигурно



# Задача 86. При проучване направено през 2007 година от 500 анкетирани 26 били вегетарианци. През 2019 година е направено 
#     ново проучване, според което 43 от 540 анкетирани отговорили, че са вегетарианци. Дават ли ни тези данни основание да твърдим, 
#     че процентът на вегетарианците през 2019 година се е увеличил спрямо 2007 година?

# Въпрос е дали, проучванията са зависими - кандидатите очевидно не са, значи най-вероятно проучванията са независими
# => нещо яко - prop.test(z-тест за пропорция) не се вълнува от зависимостта им

# Питаме се какъв процент(вероятност, пропорция) са вегетарианците, т.е ни бута към z-тест за разлика на пропорции
# А ние можем да изпълним такъв, ако приемем, че всеки човек е Бернулиев опит, за да е вегетарианец, т.е проучванията през 2007 и 2019,
# са съответно Биномни разпределения, като суми на N независими бернулиеви опита => изпълняваме z-тест

x <- c(26, 43)
n <- c(500, 540)
# Ho: p1 == p2
# H1: p1 < p2 => опция less, понеже опцията съвпада със знака на неравенството

p_value <- prop.test(x, n, alternative = "less", correct = FALSE)$p.value
p_value # 0.03683093 < 0.05 съответно отхвърляме Ho в полза на H1, тъй като имаме основания да твърдим (малко вероятно е да се наблюдават
# такива отклонения при тези емпирични данни), че процентът на вегетарианците е останал същия, тоест е по-вероятно да се е повишил



# Задача 87. За определяне на съдържанието на примеси в сплави на стомана съществуват два метода. 
# В 8 проби е определено съдържанието на примеси по всеки от двата метода. Данните са следните:

# Преди да продължим с условието е редно и очевидно да кажем, че пробите са зависими, защото тестваме с различни методи(условия) 1 и същи проби(обекти)
# Не е важно за нашите цели за средно поредния номер на обекта, можем да го пропуснем
method1_values <- c(1.2, 1.3, 1.5, 1.4, 1.7, 1.8, 1.4, 1.3)
method2_values <- c(1.4, 1.7, 1.5, 1.3, 2.0, 2.1, 1.7, 1.6) # Обръщам внимание, че подредбата на данните има значение

# Считаме, че данните са от нормално разпределение (тоест и за n < 30 можем да приложим t-test за разлика на средни). 
# Може ли да се приеме, че двата метода дават в средно едни и същи резултати?

# Ho: Е(М1) = Е(М2)
# H1: E(M1) != E(M2)

n <- length(method1_values)
# Редно е да си пишем за четимост кога е mu и кога y
p_value <- t.test(x = method1_values, y = method2_values, paired = TRUE, alternative = "two.sided")$p.value 
p_value # 0.01025955 < 0.05 => имаме основание да твърдим, че двата метода НЕ дават едни и същи резултати, т.е да отхвърлим Ho



# !!! Гадна задача, която показва, че трябва да знаем df формулата по време на изпит - ако нямаме разпределението(данните), а имаме само sd и mu

# Задача 88. За да се сравни скоростта на четене при различни шрифтове, на две групи от по 50 човека е даден един и същи текст, 
#   но на първата бил написан с един шрифт, а на втората с друг. Регистрирано е времето, за което всеки участник е прочел текста. 
#   Резултатите са: 
#     за първата група– средно 7.88 минути и стандартно отклонение 1.73; 
#     за втората група– средно 8.48 и стандартно отклонение 2.12. 
#   Може ли да се твърди, че средното време за четене е различно за двата шрифта?

# Очевидно n > 50 (ЦГТ), ще гледаме средни между 2 извадки, т.е ще приложим t-test за средно. Понеже индивидите, върху които 
# тестваме са различни, то извадките са независими една от друга

# !NB! - НЕ СИ ГЕНЕРИРАМЕ числа, а трябва да приложим теста, т.е да бръкнем във формулата
x_mean <- 7.88
x_sd <- 1.73
x_var <- x_sd ^ 2
n <- 50

y_mean <- 8.48
y_sd <- 2.12
y_var <- y_sd ^ 2
m <- 50

t_observed <- (x_mean - y_mean) / sqrt(x_var/n + y_var/m) 
t_observed
x_normalized <- x_var / n
y_normalized <- y_var / m
df <- floor((x_normalized + y_normalized) ^ 2 / ( x_normalized ^ 2 / (n - 1) + y_normalized ^ 2 / (m - 1)))
df

# Ho: EX = EY
# H1: EX != EY

# P(EX != EY) = P(Z != t_obs) = 2 * P(T > |t_obs|) = 2 * (1 - P(T <= |t_obs|))
p_value <- 2 * (1 - pt(abs(t_observed), df))
p_value # 0.1243729 > 0.05, т.е нямаме достатъчно основание, за да твърдим, че времето за четене на двата шрифта е различно. Запазваме Ho