# R примерен изпит 2023/24 година

# Задача 1. Хвърляме зар 4 пъти. Напишете код на R за симулация, с която се намира приближение на вероятността 
#   на събитието „сумата от точките на първите две хвърляния е по-голяма от сумата на следващите две хвърляния“.

# Изпълнява 1 симулация и връща истина/лъжа
sim_dice_throws <- function(total_dices, first_group_size) {
  
  if (first_group_size >= total_dices) {
    first_group_size = floor(total_dices / 2) # За да покрием граничния случай, който обезсмисля експеримента
  }
  thrown_dices <- sample(1:6, total_dices, replace = TRUE)
  
  sum_first_two_dices <- sum(thrown_dices[1:first_group_size])
  sum_other_dices <- sum(thrown_dices[(first_group_size + 1):total_dices])
  
  sum_first_two_dices > sum_other_dices
}

prob_dice_throws <- function(trials, total_dices, first_group_size) {
  result <- replicate(trials, sim_dice_throws(total_dices, first_group_size))
  sum(result) / trials
}

dice_probability <- prob_dice_throws(trials = 100000, total_dices = 4, first_group_size = 2)
dice_probability # Около 0.4451 от случаите първите 2 зара имат по-голяма сума от последните 2













# Задача 2. Извършен е експеримент, при който за сглобяването на даден елемент е използван робот. От 500 елемента, сглобени от робота, 
#   15 се оказали дефектни. Известно е, че при сглобяване от човек дефектни са около 3.5% от елементите. Напишете код на R, 
#   който бихте използвали, за да отговорите на въпроса: Може ли да се твърди, че процентът дефектни елементи при използване на робот 
#   е по-малък отколкото при сглобяване от човек?

#   Дайте обоснован отговор на въпроса с помощта на един от резултатите по-долу (само един от
#   резултатите е верен). Формулирайте хипотезите и дефинирайте използваните означения.

# data: 15 out of 500, null probability 0.035
# X-squared = 0.23686, df = 1, p-value = 0.3132
# alternative hypothesis: true p is less than 0.035

# data: 15 out of 500, null probability 0.035
# X-squared = 0.23686, df = 1, p-value = 0.6868
# alternative hypothesis: true p is greater than 0.035


# Големият въпрос е какъв е типът на теста. Понеже стойностите са фиксирани (3.5%) срещу емпирични, то той е върху 1 извадка
# Не знаем теоретична дисперсия, т.е z-тест за средно отпада. "процентът дефектни елементи при използване на робот" ни навежда към пропорция
# Не ни води към средно, понеже не се питаме от X1,...,Xn опита колко части бихме средно дефектирали. Тук се изисква да проверим вероятност.

# Ще използваме prop.test
# Ho: p = p_zero
# H1: p(робот) < p_zero(от човек, фиксираната пропорция)

p_zero <- 3.5 / 100
prop_result <- prop.test(x = 15, n = 500, p = p_zero, alternative = "less", correct = FALSE)
# !!! В алтернативната хипотеза ни стои каквото сме задали в prop.test т.е H1, т.е alternative hypothesis: true p is less than 0.035
prop_result$p.value # 0.2714759 - това е без корекция
# Понеже p_value е > 0.05(алфа), то нямаме достатъчно основание да отхвърлим нулевата хипотеза Ho, t.e процентът дефектни елементи при робот
# и при човек продължваме да твърдим, че е един и същ










# Задача 3. Имаме таблица с оценките на 80 студенти от един поток по Алгебра 1 и по Алгебра 2. Оценките по Алгебра 1 са записани 
#  във вектор a1, а оценките по Алгебра 2– във вектор a2. Напишете код на R, който бихте използвали, за да отговорите на въпроса: 
#  Може ли да се твърди, че в средно оценките по Алгебра 1 са по-високи от тези по Алгебра 2?
#  Дайте обоснован отговор на въпроса с помощта на един от резултатите по-долу (само един от резултатите е верен). 
#  Формулирайте хипотезите и дефинирайте използваните означения.

# Paired t-test
# data: a1 and a2
# t = 4.4441, df = 79, p-value = 1.422e-05
# alternative hypothesis: true difference in means is greater than 0
# sample estimates:
#   mean of the differences 0.2

# Welch Two Sample t-test
# data: a1 and a2
# t = 1.1073, df = 155.37, p-value = 0.1349
# alternative hypothesis: true difference in means is greater than 0
# sample estimates:
#   mean of x mean of y
# 4.7625
# 4.5625



# 2 извадки, ключовото е че са зависими (тестваме едини и същи обекти - студенти) при различни условия (Алгебра 1 и 2)
# t-test за средно за зависими извадки

n <- 80

# * ВАЖНО !! - R не приема имена, които са от типа буквиЦифри => букви_цифри е ОК
a_1 <- rnorm(n, 4, sqrt(2)) # генерира извадка от 80 числа (оценки между 2 и 6 като приема за средно 4 и дисперсия 2)
a_2 <- rnorm(n, 4, sqrt(2))


# H0: mu_a1 == mu_a2
# H1: mu_a1 > mu_a2
t_test_result <- t.test(x = a_1, y = a_2, alternative = "greater", paired = TRUE)

# Welch Two Sample t-test е ако са независими !!!
# Paired очевидно е при зависими, каквито са нашите
t_test_result$p.value # 0.8644947 са за моите конкретни данни, но това не се пита по условие

# Гледаме тук:
# Paired t-test
# data: a1 and a2
# t = 4.4441, df = 79, p-value = 1.422e-05
# alternative hypothesis: true difference in means is greater than 0
# sample estimates:
#   mean of the differences 0.2

# p-value = 1.422e-05 = 1.422 * 10^(-5) = 0.00001422 < 0.05 => Отхвърляме Ho в полза на H1, тъй като имаме основание да твърдим, че
# средно оценките по А1 са по-високи от тези по А2

















# Задача 4. Във файла students.csv има данни за студентите, записали курса Приложна ста
# тистика в дадена година. Файлът съдържа следните променливи:
#   grade оценка на редовната сесия;
# study.hours брой часове, отделени за подготовка за изпита;
# lectures брой посетени лекции през семестъра.
# Използвайте следния резултат от R за построен линеен модел.
# Call:
#   lm(formula = grade ~ study.hours)
# Coefficients:
#   Estimate Std. Error t value Pr(>|t|)
# (Intercept) 1.01617
# 0.39998
# study.hours 0.15806
# 0.01863
# 2.541
# 0.0134
# 8.484 2.9e-12
# Multiple R-squared: 0.5142, Adjusted R-squared: 0.507
# > cor(students)
# study.hours lectures
# study.hours
# grade
# 1.0000000 0.1441023 0.7170714
# lectures
# grade
# 0.1441023 1.0000000 0.4236842
# 0.7170714 0.4236842 1.0000000
# а) Напишете оцененото регресионно уравнение.
# б) Интерпретирайте оценения коефициент за предиктора.
# в) Може ли да се твърди, че има линейна връзка между оценката и часовете, отделени за
# подготовка?
#   г) Даден е и резултат от R за друг линеен модел:
#   Call:
#   lm(formula = grade ~ study.hours + lectures)
# Coefficients:
#   Estimate Std. Error t value Pr(>|t|)
# (Intercept) 0.54255
# 0.37352
# study.hours 0.14767
# 0.01680
# 1.453
# 0.151
# 8.791 9.06e-13
# lectures
# 0.09432
# 0.02197
# 4.293 5.81e-05
# Multiple R-squared: 0.619, Adjusted R-squared: 0.6076
# Напишете оцененото регресионно уравнение. Интерпретирайте коефициентите пред предик
# торите